req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:dn="http://www.onvif.org/ver10/network/wsdl"><SOAP-ENV:Header><wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To><wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Hello</wsa:Action><wsa:MessageID>urn:uuid:1e4e4d91-d49e-3c49-b90b-705f6cdfa25a</wsa:MessageID><wsd:AppSequence MessageNumber="1" InstanceId="2"/></SOAP-ENV:Header><SOAP-ENV:Body><wsd:Hello><wsa:EndpointReference><wsa:Address>urn:uuid:00091870-fd26-0000-0000-000000000000</wsa:Address></wsa:EndpointReference><wsd:Types>dn:NetworkVideoTransmitter</wsd:Types><wsd:Scopes>onvif://www.onvif.org/type/video_encoder onvif://www.onvif.org/type/Network_Video_Transmitter onvif://www.onvif.org/type/audio_encoder onvif://www.onvif.org/hardware/SNP-3371TH onvif://www.onvif.org/Profile/Streaming onvif://www.onvif.org/location/country/korea onvif://www.onvif.org/location/city/seoul onvif://www.onvif.org/name/SNP-3371TH </wsd:Scopes><wsd:XAddrs>http://192.168.0.100/onvif/device_service</wsd:XAddrs><wsd:MetadataVersion>1</wsd:MetadataVersion></wsd:Hello></SOAP-ENV:Body></SOAP-ENV:Envelope>